{"format": "graph-model", "generatedBy": "2.3.1", "convertedBy": "TensorFlow.js Converter v3.4.0", "signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "9"}, {"size": "9"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "9"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros_1/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}, {"size": "288"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown_0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "72"}, {"size": "288"}]}}}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "288"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "72"}, {"size": "72"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "72"}]}}}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "72"}, {"size": "72"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_5", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "72"}]}}}}}, {"name": "unknown_6", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "72"}, {"size": "72"}]}}}}}, {"name": "unknown_7", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "72"}]}}}}}, {"name": "unknown_8", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "72"}, {"size": "9"}]}}}}}, {"name": "unknown_9", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}]}}}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "9"}, {"size": "9"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_35", "op": "Enter", "input": ["unknown"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_36", "op": "Enter", "input": ["unknown_0"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_37", "op": "Enter", "input": ["unknown_1"], "attr": {"T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_29", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/time"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_27", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_counter"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/model/lstm/Shape", "op": "Shape", "input": ["input_1"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/transpose", "op": "Transpose", "input": ["input_1", "StatefulPartitionedCall/model/lstm/PartitionedCall/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_46", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_35", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_82"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_47", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_36", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_83"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_48", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_37", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_84"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_40", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_29", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_76"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_38", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_27", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_74"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/lstm/Shape", "StatefulPartitionedCall/model/lstm/strided_slice/stack", "StatefulPartitionedCall/model/lstm/strided_slice/stack_1", "StatefulPartitionedCall/model/lstm/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/transpose", "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/transpose"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/model/lstm/strided_slice", "StatefulPartitionedCall/model/lstm/zeros_1/packed/1"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/model/lstm/strided_slice", "StatefulPartitionedCall/model/lstm/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_34", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/Shape", "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/model/lstm/zeros_1/packed", "StatefulPartitionedCall/model/lstm/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/model/lstm/zeros/packed", "StatefulPartitionedCall/model/lstm/zeros/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_45", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_34", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_81"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_33", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_32", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/zeros_1"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_31", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/zeros"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_30", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_44", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_33", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_80"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_43", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_32", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_79"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_42", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_31", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_78"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_41", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_30", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_77"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/cond/_25/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_40", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_44", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_38"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_49", "op": "LoopCond", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/cond/_25/while/Less"]}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_16_switch/_55", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_43", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_49"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_57", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_45", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_49"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_17_switch/_58", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_46", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_49"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_15_switch/_54", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_42", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_49"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_18_switch/_59", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_47", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_49"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_19_switch/_60", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_48", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_49"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/time_switch/_52", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_40", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_49"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_counter_switch/_50", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_38", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_49"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1_switch/_53", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_41", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_49"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_switch/_56", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_44", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_49"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_61", "op": "Identity", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_counter_switch/_50:1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/exit/_65", "op": "Exit", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1_switch/_53"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/split/split_dim", "op": "Const", "input": ["^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_61"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_81", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_57:1", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_61"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_61"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_82", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_17_switch/_58:1", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_61"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_83", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_18_switch/_59:1", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_61"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_15_switch/_54:1", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_18_switch/_59:1", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_61"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_84", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_19_switch/_60:1", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_61"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/input/_101", "op": "Identity", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/time_switch/_52:1", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_61"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/add_2/y", "op": "Const", "input": ["^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_61"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/add_3/y", "op": "Const", "input": ["^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_61"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_80", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_switch/_56:1", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_61"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/exit/_65", "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "num_elements": {"i": "-1"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_57:1", "Func/StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/input/_101", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/add_2", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/input/_101", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/add_2/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/add_3", "op": "AddV2", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_counter_switch/_50:1", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/add_3/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_2/stack", "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_2/stack_1", "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_2/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_17_switch/_58:1"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_76", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/add_2", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_61"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_74", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/add_3", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_61"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_2", "unknown_2", "unknown_3"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/MatMul", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/model/dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/add", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_19_switch/_60:1"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model/dense_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense/Tanh", "unknown_4", "unknown_5"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/split", "op": "Split", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/split/split_dim", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/BiasAdd"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense_1/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/model/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense_2/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense_1/Tanh", "unknown_6", "unknown_7"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/Sigmoid_1", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_16_switch/_55:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/Sigmoid", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense_2/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/model/dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/mul", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense_3/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense_2/Tanh", "unknown_8", "unknown_9"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/Tanh_1", "op": "Tanh", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_79", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/add_1", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_61"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense_3/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/model/dense_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/Sigmoid_2", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/Tanh_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model/dense_3/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_78", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/mul_2", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_61"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1_switch/_53:1", "Func/StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/input/_101", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/mul_2"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_77", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/TensorArrayV2Write/TensorListSetItem", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_61"], "attr": {"T": {"type": "DT_VARIANT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/zeros_1/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/zeros_1/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "shape": [2], "dtype": "int32"}, {"name": "unknown", "shape": [9, 288], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/lstm/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/zeros/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/zeros/Const", "shape": [], "dtype": "float32"}, {"name": "unknown_0", "shape": [72, 288], "dtype": "float32"}, {"name": "unknown_1", "shape": [288], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/time", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/transpose/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_counter", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_2/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_2/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_2/stack_2", "shape": [1], "dtype": "int32"}, {"name": "unknown_2", "shape": [72, 72], "dtype": "float32"}, {"name": "unknown_3", "shape": [72], "dtype": "float32"}, {"name": "unknown_4", "shape": [72, 72], "dtype": "float32"}, {"name": "unknown_5", "shape": [72], "dtype": "float32"}, {"name": "unknown_6", "shape": [72, 72], "dtype": "float32"}, {"name": "unknown_7", "shape": [72], "dtype": "float32"}, {"name": "unknown_8", "shape": [72, 9], "dtype": "float32"}, {"name": "unknown_9", "shape": [9], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/TensorArrayV2Read/TensorListGetItem/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/add_2/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_26/while/add_3/y", "shape": [], "dtype": "int32"}]}]}